{
	"phases": [
		{
			"phase": "Concept",
			"blocks": [
				{
					"title": "Digital Twin",
					"content": "The concept of a Digital Twin is broad — many definitions co-exist. When developing a new Digital Twin application, the first step is always to define the user stories. Which processes and which users does the Digital Twin need to support?",
					"components": [
						{
							"subtitle": "As-Is Situation",
							"text": "Big Data integration. Models to predict or shape parts that are not covered.",
							"icon": ""
						},
						{
							"subtitle": "Real-time Insights",
							"text": "Live view of what is happening right now. Monitoring",
							"icon": ""
						},
						{
							"subtitle": "Behavioural Modelling",
							"text": "Modelling and Simulation.",
							"icon": ""
						}
					],
					"persons": [],
					"image": ""
				}
			]
		},
		{
			"phase": "Preparation",
			"blocks": [
				{
					"title": "Requirements Analysis",
					"content": "The concept of a Digital Twin is broad — many definitions co-exist. When developing a new Digital Twin application, the first step is always to define the user stories. Which processes and which users does the Digital Twin need to support?<img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/design-sprint-geo-assistent.jpg' />",
					"components": [
						{
							"subtitle": "Consultancy",
							"text": "Consultants are the first to come into action to perform a requirements analysis. The consultant determines the needs of the client and translates them into a clear project plan. The plan defines what data and information are required and what functionalities and tools need to be developed.",
							"icon": ""
						},
						{
							"subtitle": "UX Design",
							"text": "Based on the wishes, a User Experience (UX) design can be made for the Digital Twin application. The design focusses on the end users in order to provide a relevant and user-friendly experience. The input from the consultants is central to create a design that is intuitive and easy to use.",
							"icon": ""
						}
					],
					"persons": ["Consultant", "User Experience Designer"],
					"image": "https://storage.googleapis.com/ahp-research/projects/sogelink/hackathon/images/requirementanalyse.jpg",
					"render": {
						"type": "earth",
						"size": 6,
						"texture": "https://1.bp.blogspot.com/-UUXaK5GCj-k/UcsKJRMgkVI/AAAAAAAACfM/sePP_H08JTQ/s1600/1.jpg"
					}
				},
				{
					"title": "Open Data",
					"content": "Data is the foundation of a Digital Twin. Open source datasets are often of great use. These data are freely available to the public without restrictions or costs. Many governments and research institutions provide open data to stimulate research and innovation. Open data is extremely valuable to save time and costs when developing a Digital Twin.",
					"components": [
						{
							"subtitle": "Key Registers",
							"text": "National governments can be important data suppliers. For example, the Netherlands have large amounts of high-quality open data available thanks to the Key Registers. The <a href='https://www.pdok.nl/' target='_blank'>PDOK</a> (Publieke Dienstverlening Op de Kaart) is the central platform for open geospatial data in the Netherlands.",
							"icon": "https://avatars.githubusercontent.com/u/7768379?s=280&v=4"
						},
						{
							"subtitle": "European Data Portal",
							"text": "The European Data Portal aggregates open data from European countries, providing access to datasets related to various sectors, including transportation, environment, and public services.",
							"icon": "https://data.europa.eu//themes/edp3/assets/images/edp-logo.png"
						},
						{
							
							"subtitle": "NASA/ESA",
							"text": "NASA and ESA offer Earth observation datasets with high-quality imagery and geospatial data, including data related to climate and land cover.",
							"icon": "https://www.geospatialworld.net/wp-content/uploads/2021/07/esaNasaVertStackLogos.png"
						}
					],
					"persons": ["Researcher"],
					"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/petroleum-infrastructuur-nl.png",
					"render": {
						"type": "earth",
						"size": 6,
						"texture": "https://1.bp.blogspot.com/-UUXaK5GCj-k/UcsKJRMgkVI/AAAAAAAACfM/sePP_H08JTQ/s1600/1.jpg"
					}
				},
				{
					"title": "Data Collection",
					"content": "Open data is not always enough to meet the project requirements. Additional data may need to be collected to create a sufficiently accurate and up-to-date geospatial database.",
					"components": [
						{
							"subtitle": "Field surveys",
							"text": "Field surveys can be organized to collect geospatial data. Field workers may collect extra data on the location and condition of assets, such as buildings, roads or water barriers. For example, point clouds can be collected using LiDAR equipment.",
							"icon": ""
						},
						{
							"subtitle": "Sensors",
							"text": "IoT sensors can be used to collect real-time data. Sensors can be used to monitor water levels, air quality, temperature, noise, and many other environmental factors. Data collected by sensors can be used to create a real-time representation of the environment in the Digital Twin.",
							"icon": ""
						},
						{
							"subtitle": "Archives",
							"text": "Organizations often have large data archives that are not publicly available. Getting access to these archives can be a challenge, but often proves very valuable to the Digital Twin.",
							"icon": ""
						}
					],
					"persons": ["Researcher", "Field Worker"],
					"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/AR%20-%20foto%20GOconnectIT.jpg",
					"render": {
						"type": "earth",
						"size": 6,
						"texture": "https://1.bp.blogspot.com/-UUXaK5GCj-k/UcsKJRMgkVI/AAAAAAAACfM/sePP_H08JTQ/s1600/1.jpg"
					}
				}
			]
		},
		{
			"phase": "Data Core",
			"blocks": [
			{
				"title": "Technical Platform",
				"content": "The technical platform is the core for running the Digital Twin with all data integrated. It consists of various software components to manage tasks like data storage, data processing tools and data management. These software components are the building blocks of the Digital Twin infrastructure.",
				"components": [
					{
						"subtitle": "Hosting & Deployment",
						"text": "The building blocks of the Digital Twin infrastructure are hosted on a single cloud platform. The cloud environment provides the resources and ensures the scalability of the platform — it dynamically adapts as the amount of data grows. Hosting of the Sogelink Digital Twin is organized via the Google Cloud. The building blocks are deployed in so-called indepdent containers. Containerization is a modular approach that prevents conflicts between different software components and ensures that the software runs consistently.",
						"icon": "https://kubernetes.io/images/favicon.png"
					},
					{
						"subtitle": "Open source",
						"text": "The Digital Twin infrastructure is built on open-source software. Open-source software is software with a source code that anyone can inspect, modify and enhance. Open-source software is flexible and can be adapted to the specific needs of the project. The Sogelink Digital Twin platform is built on open-source software, including PostgreSQL, PostGIS, CesiumJS, and Docker.",
						"icon": ""
					},
					{
						"subtitle": "Open standards",
						"text": "Data standards are an essential pillar for efficiently operating a Digital Twin. Standards allows for producing data that can be used widely and reliably. There are standards for data formats, metadata, data catalogs and data exchange. The Digital Twin infrastructure is built on open standards to ensure that the data and services are interoperable and can be used across different systems.",
						"icon": ""
					},
					{
						"subtitle": "Security",
						"text": "Protecting the data and ensuring the security and privacy of sensitive information are important. The platform includes security features to protect against cyber threats and unauthorized access. User roles can be created to manage who can access which parts of the data and infrastructure. This allows us to comply with the ISO standards for digital security.",
						"icon": "https://services.geodan.nl/public/document/_/api/data/GEOD1593WEBS/logo/default"
					}
				],
				"contentAfter": "<img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/DT%20architecture.png' />",
				"persons": ["Platform Admin", "Architect", "Back-end Developer"],
				"image": "https://d3caycb064h6u1.cloudfront.net/wp-content/uploads/2022/10/dataprocessing-scaled.jpg",
				"render": {
					"type": "glb",
					"url": "https://storage.googleapis.com/ahp-research/maquette/models/sm_windturbine.glb"
				}
			},
			{
				"title": "Data Storage",
				"content": "Digital Twinning is all about data — and this data needs to be stored somewhere. Databases are used to store the data that we have collected. There are many different types of databases, each with its own advantages and disadvantages. The choice of database depends on the data formats and the desired end-use.",
				"components": [
					{
						"subtitle": "Object Storage",
						"text": "Data can be saved as files. Think about raster files, images or text based files such as CSV or JSON. Such files are stored in so-called cloud storage buckets. The storage buckets can be used to store and retrieve data files and are flexible to scale up or down. File storage is also often referred to as 'object storage' or 'blob storage'.",
						"icon": "https://miro.medium.com/v2/resize:fit:256/1*CHzvR53_W9FR2s1BQW9Bqg.png"
					},
					{
						"subtitle": "Relational data",
						"text": "Data in a table-like format (columns and rows) is stored in relational databases. PostgreSQL is an open-source database system for storing the relational geospatial data. Relational databases are used in combination with Structured Query Language (SQL) to add, delete and edit the data.",
						"icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Postgresql_elephant.svg/1985px-Postgresql_elephant.svg.png"
					},
					{
						"subtitle": "Real-time data",
						"text": "Real-time data is data that is continuously collected and processed by sensors. Real-time data is often used in Digital Twins to provide live information about for example traffic or weather. The quantities of real-time data can be huge and proper data handling is a challenge. DuckDB in combination with Parquet files provide an optimzed way to manage and query large real-time datasets.",
						"icon": "https://db.cs.uni-tuebingen.de/teaching/ws2324/what-makes-the-duck-quack/duckdb-logo.svg"
					}
				],	
				"persons": ["Data Specialist", "Data Manager"],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/bag-3d-image.jpg",
				"render": {
					"type": "glb",
					"url": "https://storage.googleapis.com/ahp-research/maquette/models/sm_windturbine.glb"
				}
			},
			{
				"title": "Data Management",
				"content": "As the amount of data increases, it is easy to lose the overview. Data management is all about keeping track of the data quality, reliability and other metdata. Data management maintains the data well-organized and easy to find according to the FAIR principles (Findable, Accessible, Interoperable, Reusable).",
				"components": [
					{
						"subtitle": "Data Management System",
						"text": "Datasets are registered in a catalog. The catalog provides an overview of all the datasets that are available in the Digital Twin along with their metadata. The catalog is used to search for datasets and to find information about the datasets. CKAN is used in the Sogelink Digital Twin platform to register data.",
						"icon": "https://quintagroup.com/cms/python/images/ckan.png/@@images/f9d0b8cf-434e-49e5-a2a6-f020ace65aff.png"
					},
					{
						"subtitle": "Metadata",
						"text": "Metadata are data about data. Metadata describe datasets and provide information about its content, licenses, quality and structure. Metadata are essential to keep track of the data and to ensure that the data is reliable and can be used by different people. Within the INSPIRE initiative, the ISO-19115 is an important metadata standard for geospatial metadata.",
						"icon": "https://triplydb.com/imgs/avatars/d/6000a857cbf91b03347f4fe9.png?v=1"
					}
				],	
				"persons": ["Data Steward"],
				"image": "https://storage.googleapis.com/ahp-research/projects/sogelink/hackathon/images/data-processing-geoinformatie.jpg"
			},
			{
				"title": "Analytical Tools",
				"content": "We have our technical platform ready and gathered a bunch of data. Now it is time to shape the data to feed the Digital Twin. A data-driven approach is all about getting as much value from the data as possible. One way to do this is by combining existing data sources to create new datasets. Also, it is possible to apply modelling and machine learning techniques to extract new information from exisiting data. Reworking data in a smart way can provide enhanced insights into the available data.",
				"components": [
					{
						"subtitle": "Data fusion",
						"text": "Data fusion involves bringing together data from different sources. The goal is to combine the data to create new datasets with added value. Data fusion can be performed in many different ways. An example is our 3D Buildings dataset, where point cloud data are combined with building footprints to create 3D models of buildings.",
						"icon": "https://cdn-icons-png.freepik.com/512/9887/9887948.png"
					},
					{
						"subtitle": "AI and Machine learning",
						"text": "Machine learning (ML) is gaining importance in the world of Geo-IT to analyze large amounts of data. Machine learning is a type of Artificial Intelligence (AI) that enables computers to learn without being explicitly programmed. Machine learning algorithms can learn from data and make predictions based on what they have learned. For example, machine learning can be used to detect objects in images or to predict future events based on historical data. For example, ML can be used detect windows from aerial imagery and add this information to a building dataset.",
						"icon": "https://cdn-icons-png.freepik.com/512/9887/9887948.png"
					},
					{
						"subtitle": "Predictive Modelling",
						"text": "Modelling is performed to simulate and predict the behavior of a system. Models are basically (complex) calculations that can be used to test different scenarios under different conditions. For example, models can be used to predict the stability of infrastructural assets under different stress scenarios. In the context of smart cities, AI models can be use to predict fluxes of people in public transport and traffic.",
						"icon": "https://cdn-icons-png.freepik.com/512/9887/9887948.png"
					}
				],
				"persons": ["Modeler", "AI/ML Expert", "Programmer"],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/dall-e-futuristic.png"
			},
			
			{
				"title": "Data Processing Pipelines",
				"content": "Within the Digital Twin infrastructure, there is a lot of data exchange between the storage locations and processing tools. Often, datasets are subject to multiple data processing steps. The entire data processing pipeline is referred to as ETL: Extract, Transform, Load. We want the ETL-process to be as smooth as possible.",
				"components": [
					{
						"subtitle": "Georeferencing",
						"text": "An endless number of coordinate systems exists. It is important to align the data to the same coordinate system (i.e. georeference) to ensure that the data can be used together. GDAL is a popular open-source library for geospatial data processing. GDAL is useful to convert data to other coordinate systems (and formats).",
						"icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/GDALLogoColor.svg/1200px-GDALLogoColor.svg.png"
					},
					{
						"subtitle": "3D Data Conversion",
						"text": "For visualization, the final data is processed to 3D. PostGIS is a useful tool to construct 3D geometries in a PostgreSQL database. Sogelink Research has developed custom tooling to process the 3D geometries in a PostgreSQL database directly into standardized 3D data formats, including <a href='https://github.com/Geodan/pg2b3dm', target='_blank'>pg2b3dm</a> and <a href='https://github.com/Geodan/i3dm.export', target='_blank'>i3dm.export</a>.",
						"icon": "https://www.enbolivia.com/wp-content/uploads/2021/04/postgis-logo.png"
					},
					{
						"subtitle": "Automatized ETL pipelines",
						"text": "ETL can be complex, since the required input and output can differ per data processing tool. Automating the ETL process helps to prevent mistakes and keep the data up-to-date. <a href='https://www.mage.ai/' target='_blank'>Mage</a> is a tool that we have implemented to automate ETL processes. Such ETL-tools allow for making the complete pipeline that extracts data from a source, transforms it, and then loads it into the target system. They can also be used to schedule pipelines at regular intervals to keep the data up-to-date and ready for use.",
						"icon": "https://avatars.githubusercontent.com/u/69371472?s=280&v=4"
					},
					{
						"subtitle":"Standard data formats",
						"text": "Standardization is important to ensure that the data is consistent and can be used across the entire platform. Data formats for the input and output of the processing tools are aligned with international standards. Many of the geodata standards are maintained by the Open Geospatial Consortium (OGC). Data standardization facilitates interoperability between the data processing tools and the Digital Twin platform and streamlines the ETL processes.",
						"icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Open_Geospatial_Consortium_logo.svg/1200px-Open_Geospatial_Consortium_logo.svg.png"
					}
				],
				"persons": ["Data Specialist", "ETL Expert", "Back-end Developer", "Architect"],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/dall-e-futuristic.png"
			},

			{
				"title": "APIs and Services",
				"content": "We can store, process and manage our data. Yet, that does not mean that it magically apears in the Digital Twin. The final step in setting up the data core is serving the data, that is: making the data available. Data can be made accessible through APIs. An API is a piece of software that allows applications to communicate and exchange data between each other.",
				"components": [
					{
						"subtitle": "Web API",
						"text": "Data processing software can be embedded in a web framework and made available over HTTP. In this way, for example, modelling algortihms can be accessed directly from the web so that end-users can runs simulations on-the-fly.",
						"icon": ""
					},
					{
						"subtitle": "Database API",
						"text": "Databases can also be queried directly from the web. PostGraphile and <a href='https://github.com/CrunchyData/pg_featureserv' target='_blank'>pg_featureserv</a> are APIs to communicate with PostgreSQL databases. The custom Sogelink Research tool GoParquet was developed to query Parquet files via DuckDB. Such database APIs make it possible to directly execute SQL functions on the database to retrieve data in a targeted way, for example for a specific geographic location.",
						"icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/GraphQL_Logo.svg/1200px-GraphQL_Logo.svg.png"
					},
					{
						"subtitle": "OGC Web Map Services",
						"text": "OGC Web Map Services (WMS) and Web Map Tiled Services (WMTS) are standard protocols developed by the Open Geospatial Consortium (OGC) for sharing 2D map layers over the internet. WMS and WMTS are the most widely used services in GIS systems and provide a standardized way for clients to request and receive map images from remote servers. GeoServer is an open-source server for publishing geospatial data as web services.",
						"icon": "https://avatars.githubusercontent.com/u/186522?s=280&v=4"
					},
					{
						"subtitle": "Tiled Map Services",
						"text": "There are several alternatives to serve map layers, including Cloud Optimized GeoTIFF (COG), MBTiles and PMTiles. These solutions are used to serve map layers in a scalable and cost-effective way without the need to manage server-side functions.",
						"icon": "https://docs.protomaps.com/logo.svg"
					},
					{
						"subtitle": "OGC SensorThings API",
						"text": "The OGC SensorThings API is a standard for providing access to IoT sensor data. The SensorThings API is a standard developed by the Open Geospatial Consortium (OGC) to provide an open and unified way to interconnect IoT devices and applications over the web. FROST is an open-source implementation of the SensorThings API. FROST can be used to serve real-time sensor data in the Sogelink Digital Twin platform.",
						"icon": "https://raw.githubusercontent.com/FraunhoferIOSB/FROST-Server/v2.x/docs/images/FROST-Server-darkgrey.png"
					},
					{
						"subtitle": "Catalog APIs",
						"text": "Data within a catalog can also be made available along with their metadata through web services. Catalog APIs can be used to integrate metadata information into the Digital Twin. Furthermore, catalog web services can make datasets available as open data to other users and platforms.",
						"icon": ""
					}
				],
				"persons": ["Back-end Developer", "Architect"],
				"image": "https://storage.googleapis.com/ahp-research/projects/sogelink/hackathon/images/dataexposureduisburgsmartcity.PNG"
			}
		]
	},
	{
		"phase": "Visualization",
		"blocks": [
			{
				"title": "Map Viewer",
				"content": "We have produced the necessary data and deployed the services to serve the data. Everything is set for rolling out the Digital Twin user portal. Since the datacore complies with open data standards, we can connect a variety of front-end platforms. Map visualizations are a powerful way to present geospatial data. The possibilities to do this in 3D via web applications continue to improve.",
				"components": [
					{
						"subtitle": "CesiumJS",
						"text": "CesiumJS is an open-source software library for creating 3D globes and maps in the web browser. CesiumJS is primarily known for its capabilities in rendering geospatial data in 3D, making it a powerful tool for creating Digital Twin visualizations. CesiumJS is the core software of the Sogelink Digital Twin front-end platform to create the base canvas that integrates both 2D and 3D geospatial data. CesiumJS allows for developing interactive 3D functionalities and dynamic 3D data visualizations.",
						"icon": "https://global.discourse-cdn.com/cesium/original/2X/1/1b9df6dd0c62dcd8ffe7ea524bb33caf1921f8cf.png"
					},
					{
						"subtitle": "MapLibre",
						"text": "Other mapping libraries often also have 3D capabilities. For example, MapLibre is an open-source JavaScript library for interactive maps and is suited when complex 3D functionalities are not required. MapLibre has more limited 3D support, but is more performant for 2D map and vector data.",
						"icon": "https://wiki.openstreetmap.org/w/images/1/1d/Maplibre-logo.png"
					},
					{
						"subtitle": "User interface",
						"text": "The map viewer is equipped with a user interface that allows users to interact with the map viewer. The user interface provides tools to navigate the map, add/remove layers, set bookmarks and measure distances. The user interface is built with <a href='https://kit.svelte.dev/' target='_blank'>SvelteKit</a>, a framework for building web applications. Per project, specific modules may be developed and added to the user interface to meet the requirements of the project.",
						"icon": "https://cdn.thenewstack.io/media/2021/09/9969f494-sveltelogo.png"
					}
				],
				"persons": ["Front-end Developer"],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/cesium-globe-streets-world.png"
			},
			{
				"title": "3D Data",
				"content": "An important standard for optimized 3D data visualization is the OGC 3D Tiles standard. 3D Tiles is an open standard for streaming massive 3D geospatial datasets over the internet. The standard is actively being developed by the Cesium team and officially supported by the OGC (Open Geospatial Consortium). 3D Tiles is designed to efficiently organize and transmit large 3D datasets.<br> <img src='https://images.prismic.io/cesium/cdc4f1d8-cc75-484d-92e6-3bfc5b6d1fdf_3DTiles-Color-White.png?auto=compress,format' class='module-img' />",
				"components": [
					{
						"subtitle": "GLB/glTF",
						"text": "3D Tiles are built on GLB/glTF files. GLB (GL Binary) and glTF (GL Transmission Format) are open standard formats designed for 3D models and scenes and maintained by the Khronos Group. They are often used in computer graphics, 3D modeling and virtual/augmented reality.",
						"icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/GlTF_logo.svg/1920px-GlTF_logo.svg.png"
					},
					{
						"subtitle":"Batched 3D Models",
						"text": "Batched 3D models are collections of individual 3D models, representing structures or objects with non-uniform shapes, such as buildings. We have developed the tool <a href='https://github.com/Geodan/pg2b3dm', target='_blank'>pg2b3dm</a> to convert 3D models from a PostgreSQL database to the batched 3D Tiles format.",
						"icon": ""
					},
					{
						"subtitle":"Instanced 3D Models",
						"text": "Instanced 3D models consist of instances or repetitions of a single 3D model. Think of it as a single 3D model duplicated multiple times, often used for objects with consistent shapes, such as streetlights or trees. We have developed the tool <a href='https://github.com/Geodan/i3dm.export', target='_blank'>i3dm.export</a> to convert 3D models from a PostgreSQL database to the instanced 3D Tiles format.",
						"icon": ""
					},
					{
						"subtitle": "Point Clouds",
						"text": "Point clouds are collections of points that represent the surface of an object or area. Point clouds are typically generated by 3D scanners making use of LiDAR. Point clouds can be stored in various file formats, including LAS, LAZ, PLY, and XYZ. Point clouds can be converted to 3D Tiles using tools like <a href='https://github.com/mfbonfigli/gocesiumtiler' target='_blank'>GoCesiumTiler</a> or Oslandia's <a href='https://github.com/Oslandia/py3dtiles' target='_blank'>py3dtiles</a>.<br><img src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/point-cloud-a2.png' class='module-img' />",
						"icon": "https://avatars.githubusercontent.com/u/1655161?s=280&v=4"
					},
					{
						"subtitle": "BIM models",
						"text": "Building Information Models (BIM) are used in the construction industry to create digital representations of buildings and infrastructure. BIM models can be converted to 3D Tiles using a tool like <a href='https://github.com/Geodan/pg2b3dm', target='_blank'>pg2b3dm</a>, but often require specialized pre-processing to ensure correct georeferencing.",
						"icon": ""
					}
				],
				"persons": ["Programmer", "ETL expert"],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/3dtiles-tiles.png"
			},
			{
				"title": "3D Terrain",
				"content": "3D Terrain is essential in a geospatial Digital Twin visualization. A Digital Elevation Model (DEM) holds elevation data and is typically the starting point for a 3D terrain. DEMs are usually provided in GeoTIFF or ASC files. The elevation data usually requires pre-processing to account for gaps (e.g. on water surfaces) or irregularities.<img class='module-img' src='https://lo.calho.st/posts/printing-terrain-meshes/mesh_example.png'/>",
				"components": [
					{
						"subtitle": "Quantized mesh",
						"text": "A DEM can be processed into a triangulated 3D mesh. A quantized 3D mesh is a special type of 3D mesh that is suited for streaming massive terrain datasets to web browsers. <a href='https://github.com/geo-data/cesium-terrain-builder' target='_blank'>Cesium Terrain Builder</a> is a useful tool to make such quantized terrain meshes from GeoTIFF files.",
						"icon": ""
					},
					{
						"subtitle": "Cesium Terrain on Demand",
						"text": "Terrain data can be huge, especially when applying Digital Twinning on a national or international level. To prevent the need to store and process large terrain datasets in advance, Sogelink developed Cesium Terrain on Demand. This web service generates quantized mesh terrain tiles on demand per user from a Cloud Optimized GeoTIFF (COG).",
						"icon": ""
					}
				],
				"persons": ["Programmer", "ETL expert"],
				"image": "https://user-images.githubusercontent.com/538812/208296434-39bb50ec-7acf-4969-9f0a-546ee08138d9.png"
			}
		]
	},
	{
		"phase": "Digital Twin",
		"blocks": [	
			{
				"title": "Physical Living Environment",
				"content": "Using open data sources and the visualization tools, we can create a 3D representation of the physical living environment. The 3D viewer functions as a base canvas for the Digital Twin applications. The physical living environment can include buildings, roads, waterways, trees and other physical objects. Depending on the country, the available open data sources may vary.",
				"components": [
					{
						"subtitle": "Built Environment",
						"text": "The built environment encompasses buildings and constructions. A 3D dataset can be programmatically created whenever building footprints and point cloud data are available. Depending on the available data, the built environment can be enriched with for example street furniture (such as streetlights, benches and waste bins), wind turbines and/or eletricity pylons.",
						"icon": ""
					},
					{
						"subtitle": "Subsurface",
						"text": "The subsurface plays an important role for many spatial challenges. The Digital Twin can display data on soil types and groundwater levels, but also the subsurface networks and underground utilities.",
						"icon": ""
					},
					{
						"subtitle": "Regional Context",
						"text": "Map layers regarding road networks, vegetation/trees, aerial imagery, and other regional data is included to provide a broader context of the physical living environment.",
						"icon": ""
					}
				],
				"image": "https://storage.googleapis.com/ahp-research/projects/sogelink/hackathon/images/google3dtiles.PNG"
			},
			{
				"title": "Real-Time Insights",
				"content": "Apart from looking like the real world, a Digital Twin should also behave like the real world. From a data perspective, sensor data and the Internet of Things (IoT) can help to make the environment dynamic and bring the Digital Twin to life. Real-time data enable users to monitor the state of the Digital Twin and respond to changes as they happen.",
				"components": [
					{
						"subtitle": "Traffic and Parking Places",
						"text": "For the city of Nantes, we have visualized the traffic and parking situation in real-time. Real-time insights into traffic flows and parking availability are shown on the map and in-depth insights are provided via a dashboard.<img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/nantes-live-traffic.png'/>",
						"icon": ""
					},
					{
						"subtitle": "Ship Transponders",
						"text": "The movement of ships on the water networks are continuously tracked via an automatic identification system (AIS). The AIS data can be used to visualize the current location of ships in the Digital Twin. A time slider allows for displaying ship movements through time. The AIS data can also be used to predict the future location of ships, which is used to simulate the impact of low or high water scenarios on ship traffic.<img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/ship-ais-tracking.png'/>",
						"icon": ""
					},
					{
						"subtitle": "Ground Water Levels",
						"text": "Ground water levels directly impact societal challenges such as dike stability, crop growth and fresh water availability. Monitoring wells can be used to continuously measure ground water levels at a location. The sensor data from monitoring wells can provide insights into the real-time and past ground water levels.<img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/purmer-peilbuizen.png'/>",
						"icon": ""
					}
				],
				"image": "https://storage.googleapis.com/ahp-research/projects/sogelink/hackathon/images/data_auto-s_shutterstock_1343869916.jpg"
			},
			{
				"title": "Prediction and Simulation",
				"content": "Within the Digital Twin, we can show the current situation and display dynamic changes in the system through time. Displaying data on the map and through time is not always enough. To gain even deeper insight, the Digital Twin infrastructure can also be used to simulate different scenarios and make predictions.",
				"components": [
					{
						"subtitle": "Subsurface Modelling",
						"text": "Within the Digital Twin, we can use predictive models of the subsurface to predict the soil types of future excavation projects. With this information, contractors can for example explore opportunities to recycle soil even before any digging has started. In that way, the Digital Twin stimulate a more circular and sustainable usage of soil resources.<br><img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/circulaire-grondstromen-dashboard.png'/>",
						"icon": ""
					},
					{
						"subtitle": "Flood Barrier Stability",
						"text": "Water safety is a major concern due to rising sea levels. The Digital Twin can be used to simulate the impact of different scenarios on the stability of flood barriers. For doing so, we have coupled the Digital Twin with custom AI models of Deltares. These behavorial models can predict various failure mechanisms, such as sliding, fracturing and piping.<br><img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/tki-purmer-modelling-visualized.png'/>",
						"icon": ""
					}
				],
				"persons": ["Front-end Developer", "Data analyst", "Information analist"],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/Lekdijk_geotop_boringen.PNG"
			},
			{
				"title": "Integration BIM-GIS",
				"content": "Asset management is an application where both real-time data and predictive modelling is often combined. The Digital Twin can be used to monitor and predict the stability of constructions through the integration of BIM models into the world of GIS.",
				"components": [
					{
						"subtitle": "Sensors in Infrastructural Asssets",
						"text": "In collaboration with Rijkswaterstaat in the Netherlands, we have integrated various BIM models of infrastructural objects into the Digital Twin. Infrastructural assets are often monitored with lots of sensors, measuring for example strain, temperature and vibrations. The Digital Twin can use the sensor data to give information about maintenance needs through a set of Key Performance Indicators (KPIs).",
						"icon": ""
					},
					{
						"subtitle": "Stress Modelling",
						"text": "For the Moerdijkbrug, we have integrated a Finite Element Model (FEM) that predicts strain in the bridge under different traffic loads. The results are coupled to the BIM model to provide a detailed insight into the stress distribution across the construction.",
						"icon": ""
					}
				],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/bim-hoevesteijn.png",
				"contentAfter":"<img class='module-img' src='https://storage.googleapis.com/ahp-research/projects/communicatie/images/moerdijkbrug-fem-model.png' />"
			},
			{
				"title": "Spatial Planning",
				"content": "Spatial planning typically requires the integration of lots of different datasets. Digital Twins are able to provide such a holistic overview of the environment and support decision-making. For example, the Digital Twin can be used to compare different design options or tweak parameters.",
				"components": [
					{
						"subtitle": "Multi-Criteria Analysis (NOVEX)",
						"text": "NOVEX is a tool that is used to support spatial planning. NOVEX is used to visualize and analyze spatial data in the Digital Twin. NOVEX provides an interface to perform interactive analyses on-the-fly through an H3 analysis — a type geospatial analysis based on hexagonal grids.",
						"icon": ""
					},
					{
						"subtitle": "Geodesign",
						"text": "The Digital Twin features drawing tools to create and edit spatial plans. Based on all available data, users can design spatial plans in a targeted and informed way. Designs can be exported from the Digital Twin directly to the <a href='https://www.geodesignhub.com/' target='_blank'>Geodesign Hub</a> platform. Geodesign Hub is a web-based platform for collaborative spatial planning.",
						"icon": ""
					}
				],
				"image": "https://storage.googleapis.com/ahp-research/projects/sogelink/hackathon/images/data-processing-geoinformatie.jpg"
			},
			{
				"title": "Dashboards",
				"content": "Since the Digital Twin infrastructure adheres to open standards, it is not limited to 3D visualization applications. A Digital Twin is not equal to a 3D viewer. Other analytical applications such as interactive dashboards can be connected to the Digital Twin infrastructure for complex data analyses. Multiple applications can also be used in parallel to support different user stories.",	
				"components": [
					{
						"subtitle": "Smart City Monitor",
						"text": "Jupyter Notebooks are an interactive environment for running code and showing the results. Such analytical notebooks were used extensively in the Smart City project in Den Bosch and Breda.",
						"icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Jupyter_logo.svg/800px-Jupyter_logo.svg.png"
					},
					{
						"subtitle": "Cousteau",
						"text": "Cousteau is a dashboarding tool that is used to visualize and analyze data in the Digital Twin. Cousteau provides a user-friendly interface to create and manage dashboards. The dashboards can be used to visualize complex data and facilitate interactive analyses.",
						"icon": ""
					}
				],
				"image": "https://storage.googleapis.com/ahp-research/projects/communicatie/images/circulaire-grondstromen-dashboard.png"
			}
		]
	}
]}